app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def search_director
    Movie.find_movies_with_same_director(params[:director])